In [ ]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head()

In [4]:
df_new = df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis='columns')

In [5]:
df_new.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [7]:
from sklearn.preprocessing import LabelEncoder

In [8]:
le_sex = LabelEncoder()

In [11]:
df_new['sex_n'] = le_sex.fit_transform(df_new['Sex'])

In [12]:
df_new.head()

   Survived  Pclass     Sex   Age     Fare  sex_n
0         0       3    male  22.0   7.2500      1
1         1       1  female  38.0  71.2833      0
2         1       3  female  26.0   7.9250      0
3         1       1  female  35.0  53.1000      0
4         0       3    male  35.0   8.0500      1

In [13]:
df_new = df_new.drop('Sex', axis='columns')

In [14]:
df_new.head()

   Survived  Pclass   Age     Fare  sex_n
0         0       3  22.0   7.2500      1
1         1       1  38.0  71.2833      0
2         1       3  26.0   7.9250      0
3         1       1  35.0  53.1000      0
4         0       3  35.0   8.0500      1

In [18]:
df_new_data = df_new.drop('Survived', axis='columns')

In [19]:
target = df_new['Survived']

In [20]:
df_new_data.head()

   Pclass   Age     Fare  sex_n
0       3  22.0   7.2500      1
1       1  38.0  71.2833      0
2       3  26.0   7.9250      0
3       1  35.0  53.1000      0
4       3  35.0   8.0500      1

In [21]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [25]:
df_new_data

     Pclass   Age     Fare  sex_n
0         3  22.0   7.2500      1
1         1  38.0  71.2833      0
2         3  26.0   7.9250      0
3         1  35.0  53.1000      0
4         3  35.0   8.0500      1
..      ...   ...      ...    ...
886       2  27.0  13.0000      1
887       1  19.0  30.0000      0
888       3   NaN  23.4500      0
889       1  26.0  30.0000      1
890       3  32.0   7.7500      1

[891 rows x 4 columns]

In [32]:
df_new_data.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [33]:
df_new_data.Age = df_new_data.Age.astype(np.int64)

In [34]:
df_new_data.head()

   Pclass  Age     Fare  sex_n
0       3   22   7.2500      1
1       1   38  71.2833      0
2       3   26   7.9250      0
3       1   35  53.1000      0
4       3   35   8.0500      1

In [35]:
from sklearn import tree

In [36]:
model = tree.DecisionTreeClassifier()

In [37]:
model.fit(df_new_data, target)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [40]:
model.score(df_new_data, target)

0.9741863075196409

In [42]:
model.predict([[1, 38,71.0000,0]])

array([1])